In [2]:
import pandas as pd

In [3]:
data = {
    'Name': ["Subodh", "Rahim", "Karim", "Borat", "Maksuda"],
    'Age': [25, 11, 12, 13, 30],
    'City': ["Manila", "Dubai", "Las Vegas", "Sydney", "Washington"]
}

df = pd.DataFrame(data)
df

      Name  Age        City
0   Subodh   25      Manila
1    Rahim   11       Dubai
2    Karim   12   Las Vegas
3    Borat   13      Sydney
4  Maksuda   30  Washington

# Slicing

In [6]:
# Slicing rows 

sliced_rows = df.iloc[:3]
sliced_rows

     Name  Age       City
0  Subodh   25     Manila
1   Rahim   11      Dubai
2   Karim   12  Las Vegas

In [7]:
# Slicing columns

sliced_columns = df.iloc[:, 0: 2]
sliced_columns

      Name  Age
0   Subodh   25
1    Rahim   11
2    Karim   12
3    Borat   13
4  Maksuda   30